multiSpecieChannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
	flowInlet
	{
		type fixedValue;
		value uniform (5 0 0);
	}
	flowOutlet
	{
		type zeroGradient;
	}
	bottomSurf
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	topSurf
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	innerSurf
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	outerSurf
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	minorInlet
	{
		type fixedValue;
		value uniform (0 -10 0);
	}
	pipe
	{
		type fixedValue;
		value uniform (0 0 0);
	}
}
