multiSpecieChannel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField uniform 1e+05;

boundaryField
{
	flowOutlet
	{
		type fixedValue;
		value uniform 1e+05;
	}
	flowInlet
	{
		type zeroGradient;
	}
	bottomSurf
	{
		type zeroGradient;
	}
	topSurf
	{
		type zeroGradient;
	}
	innerSurf
	{
		type zeroGradient;
	}
	outerSurf
	{
		type zeroGradient;
	}
	minorInlet
	{
		type zeroGradient;
	}
	pipe
	{
		type zeroGradient;
	}	
}
