multiSpecieChannel/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0) //0
	(0 1 0) //1
	(0 0 1) //2
	(0 1 1) //3
	
	(1 0 0) //4
	(1 1 0) //5
	(1 0 1) //6
	(1 1 1) //7

	(1.5 -1 0) //8
	(1.5 2 0) //9
	(1.5 -1 1) //10
	(1.5 2 1) //11

	(2 -1 0) //12
	(2 2 0) //13
	(2 -1 1) //14
	(2 2 1) //15

	(4 -1 2) //16
	(4 2 2) //17
	(3 -1 2) //18
	(3 2 2) //19
	
	(2 -1 4) //20
	(2 2 4) //21
	(2 -1 3) //22
	(2 2 3) //23

	(1 0 4) //24
	(1 1 4) //25
	(1 0 3) //26
	(1 1 3) //27

	(0 0 4) //28
	(0 1 4) //29
	(0 0 3) //30
	(0 1 3) //31

	(1.5 3 0) //32
	(1.5 3 1) //33
	(2 3 0) //34
	(2 3 1) //35
);

blocks
(
	hex (0 1 3 2 4 5 7 6) (10 10 10) simpleGrading (1 1 1)
	hex (4 5 7 6 8 9 11 10) (10 10 10) simpleGrading (1 1 1)
	hex (8 9 11 10 12 13 15 14) (10 10 10) simpleGrading (1 1 1)
	hex (9 32 33 11 13 34 35 15) (10 10 10) simpleGrading (1 1 1)
	hex (12 13 15 14 16 17 19 18) (10 10 10) simpleGrading (1 1 1)
	hex (16 17 19 18 20 21 23 22) (10 10 10) simpleGrading (1 1 1)
	hex (20 21 23 22 24 25 27 26) (10 10 10) simpleGrading (1 1 1)
	hex (24 25 27 26 28 29 31 30) (10 10 10) simpleGrading (1 1 1)
);

edges
(
	arc 12 16 (3.414 -1 0.586)
	arc 13 17 (3.414 2 0.586)
	arc 14 18 (2.707 -1 1.293)
	arc 15 19 (2.707 2 1.293)
	arc 18 22 (2.707 -1 2.707)
	arc 19 23 (2.707 2 2.707)
	arc 16 20 (3.414 -1 3.414)
	arc 17 21 (3.414 2 3.414)
);

patches
(
	patch flowInlet
	(
		(0 2 3 1)
	)
	patch flowOutlet
	(
		(30 28 29 31)
	)
	patch minorInlet
	(
		(32 33 35 34)
	)
	wall pipe
	(
		(9 11 33 32)
		(11 15 35 33)
		(15 13 34 35)
		(9 32 34 13)
	)
	wall topSurf
	(
		(1 3 7 5)
		(5 7 11 9)
		(13 15 19 17)
		(17 19 23 21)
		(21 23 27 25)
		(25 27 31 29)
	)
	wall bottomSurf
	(
		(0 4 6 2)
		(4 8 10 6)
		(8 12 14 10)
		(12 16 18 14)
		(16 20 22 18)
		(20 24 26 22)
		(24 28 30 26)
	)
	wall innerSurf
	(
		(2 6 7 3)
		(6 10 11 7)
		(10 14 15 11)
		(14 18 19 15)
		(18 22 23 19)
		(22 26 27 23)
		(26 30 31 27)
	)
	wall outerSurf
	(
		(0 1 5 4)
		(4 5 9 8)
		(8 9 13 12)
		(12 13 17 16)
		(16 17 21 20)
		(20 21 25 24)
		(24 25 29 28)
	)	
);

mergePatchPairs();
//End
